DataProcessors/ЗагрузкаСпискаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСпискаСотрудников</Name>
			<Comment>Задчача №13488</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусСотрудника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Задчача №13488</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаСпискаСотрудников/Forms/Форма/Ext/Form/Module.bsl
# Область ОбработчикиСобытийФормы

// Обрабатывает начало выбора файла с сотрудниками
//
// Параметры:
//   Элемент - ЭлементУправления - элемент управления
//   ДанныеВыбора - ДанныеВыбора - данные выбора
//   ВыборДобавлением - Булево - признак выбора с добавлением
//   СтандартнаяОбработка - Булево - признак стандартной обработки
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Объект.ФорматФайла) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите формат файла!";
		Сообщение.Поле = "Объект.ФорматФайла";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл с сотрудниками";
                                   
	Если Объект.ФорматФайла = "CSV" Тогда
		Фильтр = "Текстовый документ (*.csv)|*.csv";
	ИначеЕсли Объект.ФорматФайла = "XLS" Тогда
		Фильтр = "Файл Excel (*.xlsx)|*.xlsx";
	Иначе
		Возврат;
	КонецЕсли;

	Проводник.Фильтр = Фильтр;

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

# КонецОбласти

# Область ОбработчикиКоманд

// Основная процедура чтения файла с сотрудниками
// Выбирает нужный метод чтения в зависимости от формата файла
//
// Параметры:
//   Команда - КомандаФормы - команда, вызвавшая процедуру
&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите файл!";
		Сообщение.Поле = "Объект.ПутьКФайлу";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Объект.СписокСотрудников.Очистить();

	Если Объект.ФорматФайла = "CSV" Тогда
		ПрочитатьФайл_CSV();
	ИначеЕсли Объект.ФорматФайла = "XLS" Тогда
		ПрочитатьФайл_XLSНаСервере();
	КонецЕсли;

КонецПроцедуры

// Записывает сотрудников из таблицы в справочник Сотрудники
//
// Параметры:
//   Команда - КомандаФормы - команда, вызвавшая процедуру
&НаКлиенте
Процедура ЗаписатьСотрудников(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.СписокСотрудников.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сначала загрузите сотрудников из файла!";
		Сообщение.Поле = "Объект.СписокСотрудников";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗаписатьСписокСотрудников();
	
КонецПроцедуры 

# КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обрабатывает результат выбора файла
//
// Параметры:
//   ВыбранныеФайлы - Массив - массив выбранных путей к файлам
//   ДополнительныеПараметры - Произвольный - дополнительные параметры
&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.ПутьКФайлу = ВыбранныеФайлы[0];

КонецПроцедуры

// Читает данные из файла CSV и загружает в таблицу сотрудников
// Формат файла: Сотрудник;Отдел;Статус (разделитель - точка с запятой)
&НаКлиенте
Процедура ПрочитатьФайл_CSV()

	Текст = Новый ЧтениеТекста(Объект.ПутьКФайлу, КодировкаТекста.Системная);
	
    Строка = Текст.ПрочитатьСтроку();
	Пока Строка <> Неопределено Цикл
		Данные = СтрРазделить(Строка, ";", Ложь);

		Если Данные.Количество() >= 3 Тогда // оставим на совесть заполнителя файла
			НоваяСтрока = Объект.СписокСотрудников.Добавить();
			НоваяСтрока.Сотрудник = СокрЛП(Данные[0]);
			НоваяСтрока.Отдел = СокрЛП(Данные[1]);
			НоваяСтрока.СтатусСотрудника = СокрЛП(Данные[2]);
		КонецЕсли;
		Строка = Текст.ПрочитатьСтроку();
	КонецЦикла;

КонецПроцедуры

// Читает данные из файла XLS/XLSX на сервере и загружает в таблицу сотрудников
// Столбцы: 1 - Сотрудник, 2 - Отдел, 3 - Статус
&НаСервере
Процедура ПрочитатьФайл_XLSНаСервере()

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Объект.ПутьКФайлу, СпособЧтенияЗначенийТабличногоДокумента.Значение);

	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл

		ЗначениеСотрудник = ТабличныйДокумент.Область(НомерСтроки, 1).Текст;
		ЗначениеОтдел = ТабличныйДокумент.Область(НомерСтроки, 2).Текст;
		ЗначениеСтатус = ТабличныйДокумент.Область(НомерСтроки, 3).Текст;

		ЗначениеСотрудник = СокрЛП(ЗначениеСотрудник);
		ЗначениеОтдел = СокрЛП(ЗначениеОтдел);
		ЗначениеСтатус = СокрЛП(ЗначениеСтатус);

		Если Не ПустаяСтрока(ЗначениеСотрудник) Тогда
			НоваяСтрока = Объект.СписокСотрудников.Добавить();
			НоваяСтрока.Сотрудник = ЗначениеСотрудник;
			НоваяСтрока.Отдел = ЗначениеОтдел;
			НоваяСтрока.СтатусСотрудника = ЗначениеСтатус;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Записывает список сотрудников в справочник с сопоставлением отделов и статусов
//
// Для каждого сотрудника из таблицы СписокСотрудников создается элемент справочника Сотрудники,
// производится сопоставление названия отдела и статуса с существующими значениями.
// Выводит пользователю итоговое сообщение о результатах записи.
&НаСервере
Процедура ЗаписатьСписокСотрудников()

	СопоставлениеОтделов 	= ПолучитьСопоставлениеОтделов();
	СопоставлениеСтатусов	= ПолучитьСопоставлениеСтатусов();
	ПустаяСсылкаОтдела 		= Справочники.Отделы.ПустаяСсылка();
	ПустаяСсылкаСтатуса		= Перечисления.СтатусСотрудника.ПустаяСсылка();
	КоличествоОшибок 		= 0;

	Для Каждого СтрокаСписка Из Объект.СписокСотрудников Цикл
		Попытка
			НовыйСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
			НовыйСотрудник.Наименование = СокрЛП(СтрокаСписка.Сотрудник);

			НазваниеОтдела = СокрЛП(СтрокаСписка.Отдел);
			Если СопоставлениеОтделов.Получить(НазваниеОтдела) = Неопределено Тогда
				НовыйСотрудник.Отдел = ПустаяСсылкаОтдела;	
			Иначе
				НовыйСотрудник.Отдел = СопоставлениеОтделов[НазваниеОтдела];
			КонецЕсли;

			НазваниеСтатуса = СокрЛП(СтрокаСписка.СтатусСотрудника);
			Если СопоставлениеСтатусов.Получить(НазваниеСтатуса) = Неопределено Тогда
				НовыйСотрудник.СтатусСотрудника = ПустаяСсылкаСтатуса;
			Иначе
				НовыйСотрудник.СтатусСотрудника = СопоставлениеСтатусов[НазваниеСтатуса];
			КонецЕсли;

			НовыйСотрудник.Записать();
		Исключение
			КоличествоОшибок = КоличествоОшибок + 1;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Сотрудник '%1' не записан: %2", СтрокаСписка.Сотрудник, ОписаниеОшибки());
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;

	Если КоличествоОшибок = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Успешно записано %1 сотрудников!", Объект.СписокСотрудников.Количество());
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Записано %1 из %2. Ошибок: %3", 
			Объект.СписокСотрудников.Количество() - КоличествоОшибок,
			Объект.СписокСотрудников.Количество(),
			КоличествоОшибок);
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

// Получает соответствие названий отделов и ссылок на элементы справочника Отделы
//
// Возвращаемое значение:
//   Соответствие - ключ: строка с названием отдела, значение: СправочникСсылка.Отделы
&НаСервереБезКонтекста
Функция ПолучитьСопоставлениеОтделов()

	Сопоставление = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Отделы.Наименование КАК Наименование,
		|	Отделы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Отделы КАК Отделы";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Сопоставление.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;

	Возврат Сопоставление;

КонецФункции

// Получает соответствие строковых представлений статусов сотрудников и значений перечисления
//
// Возвращаемое значение:
//   Соответствие - ключ: строковое представление статуса, значение: ПеречислениеСсылка.СтатусСотрудника
&НаСервереБезКонтекста
Функция ПолучитьСопоставлениеСтатусов()	

	Сопоставление = Новый Соответствие;
	
	Для Каждого Значение Из Перечисления.СтатусСотрудника Цикл
    	Сопоставление.Вставить(Строка(Значение), Значение);
	КонецЦикла;	

	Возврат Сопоставление;

КонецФункции

#КонецОбласти
